package reducedfractionapp;

/** Несократимая дробь.
 */
public class ReducedFraction {
    
    /* =========================== Свойства =============================== */
 
    /* ---------------------- Числитель и знаменатель --------------------- */
    
    
    
    /* =========================== Операции ============================== */

    /* ---------------------------- Порождение ---------------------------- */
    
    /** Создание дроби с указанием ее числителя и знаменателя.
    * 
    */ 

    /** Создание дроби на основе целого числа.
    * 
    */ 
    
  
    /* --------------------- Арифметические операции ---------------------- */
    
    /** Сложение двух дробей.
    * 
    */ 

    /** Вычитание двух дробей.
    * 
    */ 

    /** Умножение двух дробей.
    * 
    */ 
    
    /** Деление двух дробей.
    * 
    */ 


    /* --------------------- Операции сравнения ---------------------- */

    /** Сравнение двух дробей.
    * 
    */ 
    
    /** Эквивалентность двух дробей.
    * 
    */     

    
    /* --------------------- Операции преобразования ---------------------- */
    
    /** Представить как строку.
    * 
    */     

    /** Представить как вещественное число.
    * 
    */     
}
